In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi = {"Istanbul" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38]} # np.nan NaN değerler üretir
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [6]:
havaDurumuDataFrame.dropna() # o satır da NaN varsa komple o satırı siliyor

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [7]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [9]:
havaDurumuDataFrame.dropna(axis = 1) # NaN olmayan tek yeri getirdi

   Izmir
0     40
1     39
2     38

In [12]:
yeniVeri = {"Istanbul" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38],"Antalya" : [45,np.nan,np.nan]} 
yeniDataFrame = pd.DataFrame(yeniVeri)

In [13]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [15]:
yeniDataFrame.dropna(axis=1,thresh=2) # 2 ve üzeri NaN olanlar siliyor

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [16]:
# NaN yazan yerlere 2 yazmak istersek
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [24]:
maasSozlugu = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Calısan Ismi" : ["Ahmet","Mehmet","Recep","Burak","Zeynep","Fatma"],
               "Maas" : [100,150,200,300,400,500]
              }

In [25]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [26]:
maasDataFrame

   Departman Calısan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama        Recep   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [29]:
grupObjesi = maasDataFrame.groupby("Departman")

In [30]:
grupObjesi.count()

           Calısan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [31]:
grupObjesi.mean() # ortalama maas

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [32]:
grupObjesi.min()

          Calısan Ismi  Maas
Departman
Hukuk            Fatma   400
Pazarlama        Burak   200
Yazılım          Ahmet   100

In [33]:
grupObjesi.max()

          Calısan Ismi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Recep   300
Yazılım         Mehmet   150

In [34]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0